# Student Data
This notebook analyizes pass/fail data for class

In [1]:
names = ['Dan','Joann','Pedro','Rosie','Ethan','Vicky','Frederic','Jimmie','Rhonda','Giovanni','Francesca','Rajab','Naiyana','Kian','Jenny','Jakeem','Helena','Ismat','Anila','Skye','Daniel','Aisha','Bill','Ted']
print(names)

['Dan', 'Joann', 'Pedro', 'Rosie', 'Ethan', 'Vicky', 'Frederic', 'Jimmie', 'Rhonda', 'Giovanni', 'Francesca', 'Rajab', 'Naiyana', 'Kian', 'Jenny', 'Jakeem', 'Helena', 'Ismat', 'Anila', 'Skye', 'Daniel', 'Aisha', 'Bill', 'Ted']

In [2]:
hours = [10,11.5,9,16,9.25,1,11.5,9,8.5,14.5,15.5,13.75,9,8,15.5,8,9,6,10,12,12.5,12,8,float('nan')]
print (hours)

[10, 11.5, 9, 16, 9.25, 1, 11.5, 9, 8.5, 14.5, 15.5, 13.75, 9, 8, 15.5, 8, 9, 6, 10, 12, 12.5, 12, 8, nan]

In [3]:
scores = [50,50,47,97,49,3,53,42,26,74,82,62,37,15,70,27,36,35,48,52,63,64,float('nan'),float('nan')]
print (scores)

[50, 50, 47, 97, 49, 3, 53, 42, 26, 74, 82, 62, 37, 15, 70, 27, 36, 35, 48, 52, 63, 64, nan, nan]

In [4]:
import numpy as np
np_names = np.array(names)
np_scores = np.array(scores)
np_hours = np.array(hours)

In [5]:
np_names.shape

(24,)

In [6]:
np_scores.shape

(24,)

In [7]:
np_hours.shape

(24,)

In [8]:
import pandas as pd

In [9]:
df = pd.DataFrame({
    "Names": np_names,
    "Hours": np_hours,
    "Scores": np_scores
})

In [10]:
print(df)

        Names  Hours  Scores
0         Dan  10.00    50.0
1       Joann  11.50    50.0
2       Pedro   9.00    47.0
3       Rosie  16.00    97.0
4       Ethan   9.25    49.0
5       Vicky   1.00     3.0
6    Frederic  11.50    53.0
7      Jimmie   9.00    42.0
8      Rhonda   8.50    26.0
9    Giovanni  14.50    74.0
10  Francesca  15.50    82.0
11      Rajab  13.75    62.0
12    Naiyana   9.00    37.0
13       Kian   8.00    15.0
14      Jenny  15.50    70.0
15     Jakeem   8.00    27.0
16     Helena   9.00    36.0
17      Ismat   6.00    35.0
18      Anila  10.00    48.0
19       Skye  12.00    52.0
20     Daniel  12.50    63.0
21      Aisha  12.00    64.0
22       Bill   8.00     NaN
23        Ted    NaN     NaN

In [11]:
dataset_path="/Users/mikeyom/Documents/JuypterNotebook/datascience/z_data"

In [12]:
df = pd.read_csv(f"{dataset_path}/student.csv")

In [13]:
print(df)

         Name  Hours  Score
0         Dan  10.00   50.0
1       Joann  11.50   50.0
2       Pedro   9.00   47.0
3       Rosie  16.00   97.0
4       Ethan   9.25   49.0
5       Vicky   1.00    3.0
6    Frederic  11.50   53.0
7      Jimmie   9.00   42.0
8      Rhonda   8.50   26.0
9    Giovanni  14.50   74.0
10  Francesca  15.50   82.0
11      Rajab  13.75   62.0
12    Naiyana   9.00   37.0
13       Kian   8.00   15.0
14      Jenny  15.50   70.0
15     Jakeem   8.00   27.0
16     Helena   9.00   36.0
17      Ismat   6.00   35.0
18      Anila  10.00   48.0
19       Skye  12.00   52.0
20     Daniel  12.50   63.0
21      Aisha  12.00   64.0
22       Bill   8.00    NaN
23        Ted    NaN    NaN